class Zikr {
  final String text;
  final String? translation;
  final String? description;
  final int count;
  final String category;

  Zikr({
    required this.text,
    this.translation,
    this.description,
    this.count = 1,
    this.category = "عام",
  });
}

final List<Zikr> azkarList = [
  Zikr(
    text: "أعوذ بالله من الشيطان الرجيم: {اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ}",
    description: "من قرأها لا يزال عليه من الله حافظ و لا يقربه الشيطان حتى يصبح.",
    category: "أذكار الصباح و المساء",
  ),
  Zikr(
    text: "آمن الرسول بما أنزل إليه من ربه و المؤمنون كل آمن بالله و ملائكته و كتبه و رسله لا نفرق بين أحد من رسله و قالوا سمعنا و أطعنا غفرانك ربنا و إليك المصير. لا يكلف الله نفساً إلا وسعها لها ما كسبت و عليها ما اكتسبت ربنا لاتؤاخذنا إن نسينا أو أخطأنا ربنا و لا تحمل علينا إصراً كما حملته على الذين من قبلنا ربنا و لا تحملنا ما لا طاقة لنا به و اعف عنا و اغفر لنا و ارحمنا أنت مولانا فانصرنا على القوم الكافرين",
    description: "من قرأها فى ليلة كفتاه.",
    category: "أذكار الصباح و المساء",
  ),
  Zikr(
    text: "اللهم إنى أسألك العفو و العافية فى الدنيا و الآخرة، اللهم إنى أسألك العفو و العافية فى دينى و دنياى و أهلى و مالى، اللهم استر عوراتى و آمن روعتى، اللهم احفظنى من بين يدى و من خلفى و عن يمينى و عن شمالى و من فوقى و أعوذ بعظمتك أن أغتال من تحتى.",
    description: "تقال صباحاً و مساءً.",
    category: "أذكار الصباح و المساء",
  ),
  Zikr(
    text: "اللهم إنى أعوذ بك من الهم و الحزن وأعوذ بك من العجز و الكسل و أعوذ بك من الجبن و البخل و أعوذ بك من غلبة الدين و قهر الرجال.",
    description: "من قالها صباحاً و مساءً ذهب همه و قضى دينه.",
    category: "أذكار الصباح و المساء",
  ),
  Zikr(
    text: "أعوذ بكلمات الله التامات من شر ما خلق.",
    count: 3,
    description: "من قالها ثلاث مرات صباحاً و مساءً لم يضره شىء.",
    category: "أذكار الصباح و المساء",
  ),
  Zikr(
    text: "اللهم أنت ربى لا إله إلا أنت عليك توكلت و أنت رب العرش العظيم ما شاء الله كان و ما لم يشأ لم يكن و لا حول و لا قوة إلا بالله العلى العظيم أعلم أن الله على كل شىء قدير و أن الله قد أحاط بكل شىء علما ً اللهم إنى أعوذ بك من شر نفسى و من شر كل دابة أنت آخذ بناصيتها إن ربى على صراط مستقيم.",
    description: "من قالها أول النهار لم تصبه مصيبة حتى يمسى و من قالها آخر النهار لم تصبه مصيبة حتى يصبح.",
    category: "أذكار الصباح و المساء",
  ),
  Zikr(
    text: "اللهم صل على محمد و آل محمد كما صليت على إبراهيم و على آل إبراهيم إنك حميد مجيد و بارك على محمد و آل محمد كما باركت على إبراهيم و على آل إبراهيم إنك حميد مجيد.",
    count: 10,
    description: "من قالها عشر مرات أدركته شفاعة النبى صلى الله عليه و سلم يوم القيامة.",
    category: "أذكار الصباح و المساء",
  ),
  Zikr(
    text: "سبحان الله و بحمده.",
    count: 100,
    description: "من قالها مائة مرة حطت خطاياه و إن كانت مثل زبد البحر.",
    category: "أذكار الصباح و المساء",
  ),
  Zikr(
    text: "لا إله إلا الله وحده لا شريك له له الملك و له الحمد و هو على كل شىء قدير.",
    count: 100,
    description: "كانت له عدل عشر رقاب و كتبت له مائة حسنة و محيت عنه مائة سيئة و كانت حرزاً له من الشيطان.",
    category: "أذكار الصباح و المساء",
  ),
  Zikr(
    text: "اللهم أنت ربى لا إله إلا أنت خلقتنى و أنا عبدك و أنا على عهدك و وعدك ما استطعت أعوذ بك من شر ما صنعت أبوء لك بنعمتك على و أبوء بذنبى فأغفرلى فإنه لا يغفر الذنوب إلا أنت.",
    description: "سيد الاستغفار: من قالها حين يصبح فمات من يومه دخل الجنة و من قالها حين يمسى فمات من ليلته دخل الجنة",
    category: "أذكار الصباح و المساء",
  ),
  Zikr(
    text: "يا حى يا قيوم برحمتك أستغيث أصلح لى شأنى و لا تكلنى إلى نفسى طرفة عين.",
    description: "من قالها فقد دعى بخيرى الدنيا و الآخرة.",
    category: "أذكار الصباح و المساء",
  ),
  Zikr(
    text: "بسم الله الذى لا يضر مع اسمه شىء فى الأرض و لا فى السماء و هو السميع العليم.",
    count: 3,
    description: "من قالها ثلاث مرات لم يضره شىء.",
    category: "أذكار الصباح و المساء",
  ),
  Zikr(
    text: "{ قُلْ هُوَ اللَّهُ أَحَدٌ (1) اللَّهُ الصَّمَدُ (2) لَمْ يَلِدْ وَلَمْ يُولَدْ (3) وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ (4) }",
    count: 3,
    description: "تكفيه من كل شىء.",
    category: "أذكار الصباح و المساء",
  ),
  Zikr(
    text: "{ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ (1) مِنْ شَرِّ مَا خَلَقَ (2) وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ (4) وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ (5) }",
    count: 3,
    description: "تكفيه من كل شىء.",
    category: "أذكار الصباح و المساء",
  ),
  Zikr(
    text: "{ قُلْ أَعُوذُ بِرَبِّ النَّاسِ (1) مَلِكِ النَّاسِ (2) إِلَهِ النَّاسِ (3) مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ (4) الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ (5) مِنَ الْجِنَّةِ وَالنَّاسِ (6) }",
    count: 3,
    description: "تكفيه من كل شىء.",
    category: "أذكار الصباح و المساء",
  ),
  Zikr(
    text: "اللهم بك أصبحنا و بك أمسينا و بك نحيا و بك نموت و إليك النشور. و إذا أمسى قال اللهم بك أمسينا و بك أصبحنا و بك نحيا و بك نموت و إليك المصير.",
    category: "أذكار الصباح و المساء",
  ),
  Zikr(
    text: "اللهم إنى أصبحت أشهدك و أشهد حملة عرشك و ملائكتك و جميع خلقك أنك أنت الله لا إله إلا أنت وحدك لا شريك لك و أن محمداً عبدك و رسولك.",
    count: 4,
    description: "من قالها أربع مرات حين يصبح و حين يمسى أعتقه الله من النار.",
    category: "أذكار الصباح و المساء",
  ),
  Zikr(
    text: "اللهم إنى أصبحت منك فى نعمة و عافية و ستر فأتمم نعمتك على و عافيتك و سترك فى الدنيا و الآخرة.",
    count: 3,
    description: "من قالها ثلاث مرات إذا أصبح و إذا أمسى كان حقاً على الله تعالى أن يتم عليه.",
    category: "أذكار الصباح و المساء",
  ),
  Zikr(
    text: "اللهم ما أصبح بى أو بأحد من خلقك فمنك وحدك لا شريك لك فلك الحمد و لك الشكر.",
    description: "من قرأها صباحاً و مساءاً فقد أدى شكر يومه.",
    category: "أذكار الصباح و المساء",
  ),
  Zikr(
    text: "يا رب لك الحمد كما ينبغى لجلال وجهك و عظيم سلطانك.",
    description: "يقول الله عز و جل للملكين اكتباها كما قال عبدى حتى يلقانى فأجازيه بها.",
    category: "أذكار الصباح و المساء",
  ),
  Zikr(
    text: "رضيت بالله رباً و بالإسلام ديناً و بمحمد صلى الله عليه و سلم نبياً و رسولاً.",
    count: 3,
    description: "من قالها صباحاً و مساءا كان حقاً على الله أن يرضيه.",
    category: "أذكار الصباح و المساء",
  ),
  Zikr(
    text: "سبحان الله و بحمده عدد خلقه و رضا نفسه و زنة عرشه و مداد كلماته.",
    count: 3,
    description: "تقال ثلاث مرات صباحاً.",
    category: "أذكار الصباح",
  ),
  Zikr(
    text: "حسبى الله لا إله إلا هو عليه توكلت و هو رب العرش العظيم.",
    count: 7,
    description: "سبع مرات كفاه الله ما أهمه من أمر الدنيا و الآخرة.",
    category: "أذكار الصباح و المساء",
  ),
  Zikr(
    text: "أصبحنا على فطرة الإسلام و على كلمة الإخلاص و على دين نبينا محمد صلى الله عليه و سلم و على ملة أبينا إبراهيم حنيفاً مسلماً و ما كان من المشركين.",
    category: "أذكار الصباح",
  ),
];
